/*
- Є змінна х, якій ви надаєте довільне числове значення.
    Якщо змінна x не дорівнює нулю, виведіть 'Вірно',
    інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3*/

// let x = 1;
// if (x != 0) {
//     console.log('Вірно')
// }
// else {
//     console.log('Невірно')
// }

/*
- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).*/

/*let time =+prompt("до якої четверті години попадає ваше число")
if (time > 0 && time <= 15) {
    console.log('в першу частину години!')
} else if (time > 15 && time <= 30) {
    console.log('в другу частину години!')
} else if (time > 30 && time <= 45) {
    console.log('в третю частину години!')
} else if (time > 45 && time <= 59) {
    console.log('в четверту частину години!')
} else {
    console.log('не вiрно!!!')
    alert('не вiрно!!!')
}*/

//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

/*
let day =+prompt('у яку половину(декаду) місяця потрапляє це число?')
if (day >= 1 && day <= 10) {
    console.log('Це перша половина декаду')
} else if (day >= 10 && day <= 20) {
    console.log('Це друга половина декаду')
} else if (day >= 20 && day <= 31) {
    console.log('Це третя половина декаду')
} else {
    console.log('Визначте число від 1 до 31');
    alert('Визначте число від 1 до 31');
}*/

//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

/*
let plan =+prompt('Напоминание распорядка дня на неделю')
switch (plan) {
    case 1: alert('Понедельник: Лекция JavaScript');
        break;
    case 2: alert('Вторник: Посмотреть превью')
        break;
    case 3: alert('Среда: Лекция ReactJS')
        break;
    case 4: alert('Четверг: Сделать пробежку')
        break;
    case 5: alert('Пятница: Найти работу')
        break;
    case 6: alert('Суббота: Поехать на рыбалку')
        break;
    case 7: alert('Воскресенье: Распланировать распорядок дня недели')
        break;
    default: alert('москаляку на гілляку')
}
*/

/*
- Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.*/

/*let numA = +prompt("введите первое число");
let numB = +prompt("введите второе число");
if (numA > numB) {
    alert("Первое число больше")
} else if (numB > numA) {
    alert("Второе число больше")
} else if (numB === numA) {
    alert("Первый такой же, как второй")
}*/
